更新架构
